Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: قد علمنا ما تنقص الأرض منهم وعندنا كتاب حفيظ
en: We know that which the earth takes of them (their dead bodies), and with Us is a Book preserved (i.e. the Book of Decrees).

source: بل كذبوا بالحق لما جاءهم فهم في أمر مريج
en: Nay, but they have denied the truth (this Qur'an) when it has come to them, so they are in a confused state (cannot differentiate between right and wrong).

source: أفلم ينظروا إلى السماء فوقهم كيف بنيناها وزيناها وما لها من فروج
en: Have they not looked at the heaven above them, how We have made it and adorned it, and there are no rifts in it?

source: والأرض مددناها وألقينا فيها رواسي وأنبتنا فيها من كل زوج بهيج
en: And the earth! We have spread it out, and set thereon mountains standing firm, and have produced therein every kind of lovely growth (plants).

source: تبصرة وذكرى لكل عبد منيب
en: An insight and a Reminder for every slave who turns to Allah in repentance (i.e. the one who believes in the Oneness of Allah and performs deeds of His obedience, and always begs His pardon).

source: ونزلنا من السماء ماء مباركا فأنبتنا به جنات وحب الحصيد
en: And We send down blessed water (rain) from the sky, then We produce therewith gardens and grain (every kind of harvests) that are reaped.

source: والنخل باسقات لها طلع نضيد
en: And tall date-palms, with ranged clusters.

source: رزقا للعباد وأحيينا به بلدة ميتا كذلك الخروج
en: A provision for (Allah's) slaves. And We give life therewith to a dead land. Thus will be the resurrection (of the dead).

source: كذبت قبلهم قوم نوح وأصحاب الرس وثمود
en: Denied before them (i.e. these pagans of Makkah) the people of Nuh (Noah), and the dwellers of Rass, and Thamud;

source: وعاد وفرعون وإخوان لوط
en: And 'Ad, and Fir'aun (Pharaoh), and the brethren of Lut (Lot);

source: وأصحاب الأيكة وقوم تبع كل كذب الرسل فحق وعيد
en: And the Dwellers of the Wood, and the people of Tubba'. Everyone of them denied (their) Messengers, so My Threat took effect.

source: أفعيينا بالخلق الأول بل هم في لبس من خلق جديد
en: Were We then tired with the first creation? Nay, they are in confused doubt about a new creation (i.e. Resurrection).

source: ولقد خلقنا الإنسان ونعلم ما توسوس به نفسه ونحن أقرب إليه من حبل الوريد
en: And indeed We have created man, and We know what his ownself whispers to him. And We are nearer to him than his jugular vein (by Our Knowledge).

source: إذ يتلقى المتلقيان عن اليمين وعن الشمال قعيد
en: (Remember) that the two receivers (recording angels) receive (each human being), one sitting on the right and one on the left (to note his or her actions).

source: ما يلفظ من قول إلا لديه رقيب عتيد
en: Not a word does he (or she) utter but there is a watcher by him ready (to record it).

source: وجاءت سكرة الموت بالحق ذلك ما كنت منه تحيد
en: And the stupor of death will come in truth: "This is what you have been avoiding!"

source: ونفخ في الصور ذلك يوم الوعيد
en: And the Trumpet will be blown - that will be the Day whereof warning (had been given) (i.e. the Day of Resurrection).

source: وجاءت كل نفس معها سائق وشهيد
en: And every person will come forth along with an (angel) to drive (him) and an (angel) to bear witness.

source: لقد كنت في غفلة من هذا فكشفنا عنك غطاءك فبصرك اليوم حديد
en: (It will be said to the sinners): "Indeed you were heedless of this. Now We have removed from you your covering, and sharp is your sight this Day!"

source: وقال قرينه هذا ما لدي عتيد
en: And his companion (angel) will say: "Here is (this Record) ready with me!"

source: ألقيا في جهنم كل كفار عنيد
en: (Allah will say to the angels): "Both of you throw into Hell every stubborn disbeliever (in the Oneness of Allah, in His Messengers).

source: مناع للخير معتد مريب
en: "Hinderer of good, transgressor, doubter,

source: الذي جعل مع الله إلها آخر فألقياه في العذاب الشديد
en: "Who set up another ilah (god) with Allah. Then both of you cast him in the severe torment."

source: قال قرينه ربنا ما أطغيته ولكن كان في ضلال بعيد
en: His companion (Satan - devil)] will say: "Our Lord! I did not push him to transgression, (in disbelief, oppression, and evil deeds) but he was himself in error far astray."

source: قال لا تختصموا لدي وقد قدمت إليكم بالوعيد
en: Allah will say: "Dispute not in front of Me, I had already in advance sent you the threat.

source: ما يبدل القول لدي وما أنا بظلام للعبيد
en: The Sentence that comes from Me cannot be changed, and I am not unjust to the slaves."

source: يوم نقول لجهنم هل امتلأت وتقول هل من مزيد
en: On the Day when We will say to Hell: "Are you filled?" It will say: "Are there any more (to come)?"

source: وأزلفت الجنة للمتقين غير بعيد
en: And Paradise will be brought near to the Muttaqun (the pious. See V.2:2), not far off.

source: هذا ما توعدون لكل أواب حفيظ
en: (It will be said): "This is what you were promised - (it is) for those oft-returning (to Allah) in sincere repentance, and those who preserve their covenant with Allah (by obeying Him in all what He has ordered, and worshipping none but Allah Alone, i.e. follow Allah's religion - Islamic Monotheism).

source: من خشي الرحمن بالغيب وجاء بقلب منيب
en: "Who feared the Most Gracious (Allah) in the Ghaib (Unseen) and brought a heart turned in repentance (to Him and absolutely free from each and every kind of polytheism).

source: ادخلوها بسلام ذلك يوم الخلود
en: "Enter you therein in peace and security - this is a Day of eternal life!"

source: لهم ما يشاءون فيها ولدينا مزيد
en: There they will have all that they desire - and We have more (for them, i.e. a glance at the All-Mighty, All-Majestic جل جلاله).

source: وكم أهلكنا قبلهم من قرن هم أشد منهم بطشا فنقبوا في البلاد هل من محيص
en: And how many a generation We have destroyed before them who were stronger in power than they. And (when Our Torment came), they ran for a refuge in the land! Could they find any place of refuge (for them to save themselves from destruction)?

source: إن في ذلك لذكرى لمن كان له قلب أو ألقى السمع وهو شهيد
en: Verily, therein is indeed a reminder for him who has a heart or gives ear while he is heedful.

source: ولقد خلقنا السماوات والأرض وما بينهما في ستة أيام وما مسنا من لغوب
en: And indeed We created the heavens and the earth and all between them in six Days and nothing of fatigue touched Us.

source: فاصبر على ما يقولون وسبح بحمد ربك قبل طلوع الشمس وقبل الغروب
en: So bear with patience (O Muhammad صلى الله عليه وسلم) all that they say, and glorify the Praises of your Lord, before the rising of the sun and before (its) setting (i.e. the Fajr, Zuhr, and 'Asr prayers) .

source: ومن الليل فسبحه وأدبار السجود
en: And during a part of the night (also) glorify His praises (i.e. Maghrib and 'Isha prayers) and (so likewise) after the prayers [As-Sunnah, Nawafil - optional and additional prayers. And also glorify, praise and magnify Allah - Subhan Allah, Alhamdu lillah, Allahu-Akbar].

source: واستمع يوم يناد المناد من مكان قريب
en: And listen on the Day when the caller will call from a near place.

source: يوم يسمعون الصيحة بالحق ذلك يوم الخروج
en: The Day when they will hear As-Saihah (shout) in truth: that will be the Day of coming out (from the graves, i.e. the Day of Resurrection).

source: إنا نحن نحيي ونميت وإلينا المصير
en: Verily, We it is Who give life and cause death; and to Us is the final return.

source: يوم تشقق الأرض عنهم سراعا ذلك حشر علينا يسير
en: On the Day when the earth shall be cleft, from off them, (they will come out) hastening forth. That will be a gathering, quite easy for Us.

source: نحن أعلم بما يقولون وما أنت عليهم بجبار فذكر بالقرآن من يخاف وعيد
en: We know best what they say. And you (O Muhammad صلى الله عليه وسلم) are not the one to force them (to Belief). But warn by the Qur'an; him who fears My Threat.

source: والذاريات ذروا
en: By (the winds) that scatter dust.

source: فالحاملات وقرا
en: And (the clouds) that bear heavy weight of water.

source: فالجاريات يسرا
en: And (the ships) that float with ease and gentleness.

source: فالمقسمات أمرا
en: And those (angels) who distribute (provisions, rain, and other blessings) by (Allah's) Command.

source: إنما توعدون لصادق
en: Verily, that which you are promised (i.e. Resurrection in the Hereafter and receiving the reward or punishment of good or bad deeds) is surely true.

source: وإن الدين لواقع
en: And verily, the Recompense is sure to happen.

source: والسماء ذات الحبك
en: By the heaven full of paths,

source: إنكم لفي قول مختلف
en: Certainly, you have different ideas (about Muhammad صلى الله عليه وسلم and the Qur'an).

source: يؤفك عنه من أفك
en: Turned aside therefrom (i.e. from Muhammad صلى الله عليه وسلم and the Qur'an) is he who is turned aside (by the Decree and Preordainment القضاء والقدر of Allah).

source: قتل الخراصون
en: Cursed be the liars

source: الذين هم في غمرة ساهون
en: Who are under a cover of heedlessness (think not about the gravity of the Hereafter),

source: يسألون أيان يوم الدين
en: They ask: "When will be the Day of Recompense?"

source: يوم هم على النار يفتنون
en: (It will be) a Day when they will be tried (punished i.e. burnt) over the Fire!

source: ذوقوا فتنتكم هذا الذي كنتم به تستعجلون
en: "Taste you your trial (punishment i.e. burning)! This is what you used to ask to be hastened!"

source: آخذين ما آتاهم ربهم إنهم كانوا قبل ذلك محسنين
en: Taking joy in the things which their Lord has given them. Verily, they were before this Muhsinun (good-doers. See V.2:112).

source: كانوا قليلا من الليل ما يهجعون
en: They used to sleep but little by night [invoking their Lord (Allah) and praying, with fear and hope].

source: وبالأسحار هم يستغفرون
en: And in the hours before dawn, they were (found) asking (Allah) for forgiveness.

source: وفي أموالهم حق للسائل والمحروم
en: And in their properties there was the right of the Sa'il (the beggar who asks) and the Mahrum (the poor who does not ask others) .

source: وفي الأرض آيات للموقنين
en: And on the earth are signs for those who have Faith with certainty.

source: وفي أنفسكم أفلا تبصرون
en: And also in your ownselves. Will you not then see?

source: وفي السماء رزقكم وما توعدون
en: And in the heaven is your provision, and that which you are promised.

source: فورب السماء والأرض إنه لحق مثل ما أنكم تنطقون
en: Then by the Lord of the heaven and the earth, it is the truth (i.e. what has been promised to you), just as it is the truth that you can speak.

source: هل أتاك حديث ضيف إبراهيم المكرمين
en: Has the story reached you, of the honoured guests [three angels; Jibril (Gabriel) along with another two] of Ibrahim (Abraham)?

source: إذ دخلوا عليه فقالوا سلاما قال سلام قوم منكرون
en: When they came in to him and said: "Salam, (peace be upon you)!" He answered: "Salam, (peace be upon you)," and said: "You are a people unknown to me."

source: فراغ إلى أهله فجاء بعجل سمين
en: Then he turned to his household, and brought out a roasted calf [as the property of Ibrahim (Abraham) was mainly cows].

source: فقربه إليهم قال ألا تأكلون
en: And placed it before them, (saying): "Will you not eat?"

source: فأوجس منهم خيفة قالوا لا تخف وبشروه بغلام عليم
en: Then he conceived fear of them (when they ate not). They said: "Fear not." And they gave him glad tidings of a son having knowledge (about Allah and His religion of True Monotheism).

source: فأقبلت امرأته في صرة فصكت وجهها وقالت عجوز عقيم
en: Then his wife came forward with a loud voice: she smote her face, and said: "A barren old woman!"

source: قالوا كذلك قال ربك إنه هو الحكيم العليم
en: They said: "Even so says your Lord. Verily, He is the All-Wise, the All-Knower."

source: لنرسل عليهم حجارة من طين
en: To send down upon them stones of baked clay.

source: مسومة عند ربك للمسرفين
en: Marked by your Lord for the Musrifun (polytheists, criminals, sinners - those who trespass Allah's set limits in evil-doings by committing great sins).

source: فأخرجنا من كان فيها من المؤمنين
en: So We brought out from therein the believers.

source: فما وجدنا فيها غير بيت من المسلمين
en: But We found not there any household of the Muslims except one [of Lut (Lot) and his two daughters].

source: وتركنا فيها آية للذين يخافون العذاب الأليم
en: And We have left there a sign (i.e. the place of the Dead Sea in Palestine) for those who fear the painful torment.

source: وفي موسى إذ أرسلناه إلى فرعون بسلطان مبين
en: And in Musa (Moses) (too, there is a sign), when We sent him to Fir'aun (Pharaoh) with a manifest authority.

source: فتولى بركنه وقال ساحر أو مجنون
en: But [Fir'aun (Pharaoh)] turned away (from Belief in might) along with his hosts, and said: "A sorcerer, or a madman."

source: فأخذناه وجنوده فنبذناهم في اليم وهو مليم
en: So We took him and his hosts, and dumped them into the sea, for he was blameworthy.

source: وفي عاد إذ أرسلنا عليهم الريح العقيم
en: And in 'Ad (there is also a sign) when We sent against them the barren wind;

source: ما تذر من شيء أتت عليه إلا جعلته كالرميم
en: It spared nothing that it reached, but blew it into broken spreads of rotten ruins.

source: وفي ثمود إذ قيل لهم تمتعوا حتى حين
en: And in Thamud (there is also a sign), when they were told: "Enjoy yourselves for a while!"

source: فعتوا عن أمر ربهم فأخذتهم الصاعقة وهم ينظرون
en: But they insolently defied the Command of their Lord, so the Sa'iqah overtook them while they were looking.

source: فما استطاعوا من قيام وما كانوا منتصرين
en: Then they were unable to rise up, nor could they help themselves.

source: وقوم نوح من قبل إنهم كانوا قوما فاسقين
en: (So were) the people of Nuh (Noah) before them. Verily, they were a people who were Fasiqun (rebellious, disobedient to Allah).

source: والسماء بنيناها بأيد وإنا لموسعون
en: With power did We construct the heaven. Verily, We are Able to extend the vastness of space thereof.

source: والأرض فرشناها فنعم الماهدون
en: And We have spread out the earth: how Excellent Spreader (thereof) are We!

source: ومن كل شيء خلقنا زوجين لعلكم تذكرون
en: And of everything We have created pairs, that you may remember (the Grace of Allah).

source: ففروا إلى الله إني لكم منه نذير مبين
en: So flee to Allah (from His Torment to His Mercy - Islamic Monotheism). Verily, I (Muhammad صلى الله عليه وسلم) am a plain warner to you from Him.

source: ولا تجعلوا مع الله إلها آخر إني لكم منه نذير مبين
en: And set not up (or worship not) any other ilah (god) along with Allah [Glorified be He (Alone), Exalted above all that they associate as partners with Him]. Verily, I (Muhammad صلى الله عليه وسلم) am a plain warner to you from Him.

source: كذلك ما أتى الذين من قبلهم من رسول إلا قالوا ساحر أو مجنون
en: Likewise, no Messenger came to those before them but they said: "A sorcerer or a madman!"

source: أتواصوا به بل هم قوم طاغون
en: Have they (the people of the past) transmitted this saying to these (Quraish pagans)? Nay, they are themselves a people transgressing beyond bounds (in disbelief)!

source: فتول عنهم فما أنت بملوم
en: So turn away (O Muhammad صلى الله عليه وسلم) from them (Quraish pagans), you are not blame-worthy (as you have conveyed Allah's Message).

source: وذكر فإن الذكرى تنفع المؤمنين
en: And remind (by preaching the Qur'an, O Muhammad صلى الله عليه وسلم), for verily, the reminding profits the believers.

source: وما خلقت الجن والإنس إلا ليعبدون
en: And I (Allah) created not the jinn and mankind except that they should worship Me (Alone).

source: ما أريد منهم من رزق وما أريد أن يطعمون
en: I seek not any provision from them (i.e. provision for themselves or for My creatures) nor do I ask that they should feed Me (i.e. feed themselves or My creatures).

source: إن الله هو الرزاق ذو القوة المتين
en: Verily, Allah is the All-Provider, Owner of Power, the Most Strong.

source: فإن للذين ظلموا ذنوبا مثل ذنوب أصحابهم فلا يستعجلون
en: And verily, for those who do wrong, there is a portion of torment like to the evil portion of torment (which came for) their likes (of old); so let them not ask Me to hasten on!

source: فويل للذين كفروا من يومهم الذي يوعدون
en: Then woe to those who disbelieve (in Allah and His Oneness - Islamic Monotheism) from their Day which they have been promised (for their punishment).

source: والطور
en: By the Tur (Mount)

source: وكتاب مسطور
en: And by a Book Inscribed

source: في رق منشور
en: In parchment unrolled.

source: والبيت المعمور
en: And by Al-Bait-ul-Ma'mur (the house over the heavens parallel to the Ka'bah at Makkah, continuously visited by the angels).

source: والسقف المرفوع
en: And by the roof raised high (i.e. the heaven).

source: والبحر المسجور
en: And by the sea kept filled (or it will be fire kindled on the Day of Resurrection).

source: إن عذاب ربك لواقع
en: Verily, the Torment of your Lord will surely come to pass.

source: ما له من دافع
en: There is none that can avert it.

source: يوم تمور السماء مورا
en: On the Day when the heaven will shake with a dreadful shaking,

source: وتسير الجبال سيرا
en: And the mountains will move away with a (horrible) movement.

source: فويل يومئذ للمكذبين
en: Then woe that Day to the beliers.

source: الذين هم في خوض يلعبون
en: Who are playing in falsehood .

source: يوم يدعون إلى نار جهنم دعا
en: The Day when they will be pushed down by force to the Fire of Hell, with a horrible, forceful pushing.

source: هذه النار التي كنتم بها تكذبون
en: This is the Fire which you used to belie.

source: أفسحر هذا أم أنتم لا تبصرون
en: Is this magic, or do you not see?

source: اصلوها فاصبروا أو لا تصبروا سواء عليكم إنما تجزون ما كنتم تعملون
en: Taste you therein its heat and whether you are patient of it or impatient of it, it is all the same. You are only being requited for what you used to do.

source: إن المتقين في جنات ونعيم
en: Verily, the Muttaqun (the pious. See V.2:2) will be in Gardens (Paradise), and Delight.

source: فاكهين بما آتاهم ربهم ووقاهم ربهم عذاب الجحيم
en: Enjoying in that which their Lord has bestowed on them, and (the fact that) their Lord saved them from the torment of the blazing Fire.

source: كلوا واشربوا هنيئا بما كنتم تعملون
en: "Eat and drink with happiness because of what you used to do."

source: متكئين على سرر مصفوفة وزوجناهم بحور عين
en: They will recline (with ease) on thrones arranged in ranks. And We shall marry them to Hur: (female, fair ones) with wide lovely eyes.

source: والذين آمنوا واتبعتهم ذريتهم بإيمان ألحقنا بهم ذريتهم وما ألتناهم من عملهم من شيء كل امرئ بما كسب رهين
en: And those who believe and whose offspring follow them in Faith: to them shall We join their offspring, and We shall not decrease the reward of their deeds in anything. Every person is a pledge for that which he has earned.

source: وأمددناهم بفاكهة ولحم مما يشتهون
en: And We shall provide them with fruit and meat such as they desire.

source: يتنازعون فيها كأسا لا لغو فيها ولا تأثيم
en: There they shall pass from hand to hand a (wine) cup, free from any Laghw (dirty, false, evil vain talk between them), and free from sin (because it will be lawful for them to drink).

source: ويطوف عليهم غلمان لهم كأنهم لؤلؤ مكنون
en: And there will go round boy-servants of theirs, to serve them as if they were preserved pearls.

source: قالوا إنا كنا قبل في أهلنا مشفقين
en: Saying: "Aforetime, we were afraid (of the punishment of Allah) in the midst of our families.

source: فمن الله علينا ووقانا عذاب السموم
en: "So Allah has been gracious to us, and has saved us from the torment of the Fire.

source: إنا كنا من قبل ندعوه إنه هو البر الرحيم
en: "Verily, We used to invoke Him (Alone and none else) before. Verily, He is Al-Barr (the Most Subtle, Kind, Courteous, and Generous), the Most Merciful."

source: فذكر فما أنت بنعمت ربك بكاهن ولا مجنون
en: Therefore, remind (mankind of Islamic Monotheism, O Muhammad صلى الله عليه وسلم). By the Grace of Allah, you are neither a soothsayer, nor a madman.

source: أم يقولون شاعر نتربص به ريب المنون
en: Or do they say: "(Muhammad صلى الله عليه وسلم) is a poet! We await for him some calamity by time!"

source: قل تربصوا فإني معكم من المتربصين
en: Say (O Muhammad صلى الله عليه وسلم to them): "Wait! I am with you among the waiters!"

source: أم تأمرهم أحلامهم بهذا أم هم قوم طاغون
en: Do their minds command them this [i.e. to tell a lie against you (Muhammad صلى الله عليه وسلم)] or are they people transgressing all bounds?

source: أم يقولون تقوله بل لا يؤمنون
en: Or do they say: "He (Muhammad صلى الله عليه وسلم) has forged it (this Qur'an)?" Nay! They believe not!

source: فليأتوا بحديث مثله إن كانوا صادقين
en: Let them then produce a recital like unto it (the Qur'an) if they are truthful.

source: أم خلقوا من غير شيء أم هم الخالقون
en: Were they created by nothing? Or were they themselves the creators?

source: أم خلقوا السماوات والأرض بل لا يوقنون
en: Or did they create the heavens and the earth? Nay, but they have no firm Belief.

source: أم عندهم خزائن ربك أم هم المصيطرون
en: Or are with them the treasures of your Lord? Or are they the tyrants with the authority to do as they like?

source: أم لهم سلم يستمعون فيه فليأت مستمعهم بسلطان مبين
en: Or have they a stairway (to heaven), by means of which they listen (to the talks of the angels)? Then let their listener produce some manifest proof.

source: أم له البنات ولكم البنون
en: Or has He (Allah) only daughters and you have sons?

source: أم تسألهم أجرا فهم من مغرم مثقلون
en: Or is it that you (O Muhammad صلى الله عليه وسلم) ask a wage from them (for your preaching of Islamic Monotheism) so that they are burdened with a load of debt?

source: أم عندهم الغيب فهم يكتبون
en: Or that the Ghaib (Unseen) is with them, and they write it down?

source: أم يريدون كيدا فالذين كفروا هم المكيدون
en: Or do they intend a plot (against you O Muhammad صلى الله عليه وسلم)? But those who disbelieve (in the Oneness of Allah - Islamic Monotheism) are themselves plotted against!

source: أم لهم إله غير الله سبحان الله عما يشركون
en: Or have they an ilah (a god) other than Allah? Glorified be Allah from all that they ascribe as partners (to Him)

source: وإن يروا كسفا من السماء ساقطا يقولوا سحاب مركوم
en: And if they were to see a piece of the heaven falling down, they would say: "Clouds gathered in heaps!"

source: فذرهم حتى يلاقوا يومهم الذي فيه يصعقون
en: So leave them alone till they meet their Day, in which they will sink into a fainting (with horror).

source: يوم لا يغني عنهم كيدهم شيئا ولا هم ينصرون
en: The Day when their plotting shall not avail them at all nor will they be helped (i.e. they will receive their torment in Hell).

source: وإن للذين ظلموا عذابا دون ذلك ولكن أكثرهم لا يعلمون
en: And verily, for those who do wrong, there is another punishment (i.e. the torment in this world and in their graves) before this; but most of them know not. (Tafsir At-Tabari).

source: واصبر لحكم ربك فإنك بأعيننا وسبح بحمد ربك حين تقوم
en: So wait patiently (O Muhammad صلى الله عليه وسلم) for the Decision of your Lord, for verily, you are under Our Eyes ; and glorify the Praises of your Lord when you get up from sleep.

source: ومن الليل فسبحه وإدبار النجوم
en: And in the nighttime also glorify His Praises - and at the setting of the stars.

source: والنجم إذا هوى
en: By the star when it goes down (or vanishes).

source: ما ضل صاحبكم وما غوى
en: Your companion (Muhammad صلى الله عليه وسلم) has neither gone astray nor has erred.

source: وما ينطق عن الهوى
en: Nor does he speak of (his own) desire.

source: إن هو إلا وحي يوحى
en: It is only a Revelation revealed.

source: علمه شديد القوى
en: He has been taught (this Qur'an) by one mighty in power [Jibril (Gabriel)]

source: ذو مرة فاستوى
en: One free from any defect in body and mind then he (Jibril - Gabriel in his real shape as created by Allah) rose and became stable.

source: وهو بالأفق الأعلى
en: While he [Jibril (Gabriel)] was in the highest part of the horizon, (Tafsir Ibn Kathir)

source: ثم دنا فتدلى
en: Then he [Jibril (Gabriel)] approached and came closer,

source: فكان قاب قوسين أو أدنى
en: And was at a distance of two bows' length or (even) nearer.
